music/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @album ||= Album.new
        @band = Band.find_by(id: params[:band_id])

INSERT INTO "albums" ("title", "year", "studio", "band_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "asdadasd"], ["year", 1999], ["studio", false], ["band_id", 6]]
---
    def create
        @album = Album.new(album_params)
        if @album && @album.save!

SELECT "albums".* FROM "albums"
---
    def index
        @albums ||= Album.all

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @album = Album.find_by(id: params[:id])
        @band = Band.find_by(id: @album.band_id)