music/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "jchGYhGjhfG-83olioB4Fg"], ["LIMIT", 1]]
---
    def current_user
        @current_user ||= User.find_by(session_token: session[:session_token])