music/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
    def index
        @bands = Band.all

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "bbbbbb"], ["created_at", "2021-06-06 22:05:28.977670"], ["updated_at", "2021-06-06 22:05:28.977670"]]
---
    def create
        @band = Band.new(name: params[:band][:name])
        if @band && @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @band ||= Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "beans"], ["updated_at", "2021-06-06 22:12:20.747883"], ["id", 5]]
---
    def update
        @band = Band.find_by(id: params[:id])
        if @band && @band.update(name: params[:band][:name])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
---
    def destroy
        @band = Band.find_by(id: params[:id])
        if @band && @band.destroy