music/app/controllers/sessions_controller.rb

    def create
        @user = User.find_by_credentials(params[:user][:email], params[:user][:password])
        if @user && @user.save
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "KrTqvLAxaJAiPNOgPXunDw"], ["id", 2]]