music/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "doggoman7"], ["password_digest", "$2a$12$dvWE81DEvhrffKJbW2.fGegkTN0F1FW1ii06ecZiS/RtgkIy8TsJq"], ["session_token", "PEQQITJwXnfjR1bO0AOxGw"]]
---
    def create
        @user = User.new(user_params)
        if @user && @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @user = User.find_by(id: params[:id])