music/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "doggoman6"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "jchGYhGjhfG-83olioB4Fg"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = self.generate_session_token
        self.save